import React from "react";
import styled from "styled-components";
import Link from "next/link";
import ArticleModel from "src/model/db/Article";
import dbConnect from "src/util/dbConnect";

const ArticleWrapper = styled.div`
    padding-top: 20px;
`;

const Article = styled.div`
    border-bottom: 1px solid #dcdcdc;
    margin-bottom: 20px;
    cursor: pointer;
    &:hover {
        color: #87cefa;
    }
`;

const Title = styled.h2`
    font-size: 20px;
    font-weight: bold;
    margin-bottom: 10px;
`;

const Description = styled.div`
    font-size: 14px;
    color: #696969;
    margin-bottom: 10px;
`;

const Date = styled.div`
    font-size: 12px;
    color: #696969;
    margin-bottom: 10px;
`;

const mockData = [
    {
        title: "記事A",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/08",
        id: "00001",
    },
    {
        title: "記事B",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
    {
        title: "記事C",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
    {
        title: "記事D",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
    {
        title: "記事E",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
    {
        title: "記事F",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/08",
        id: "00001",
    },
    {
        title: "記事G",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
    {
        title: "記事H",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
    {
        title: "記事I",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
    {
        title: "記事J",
        description:
            "記事一覧あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ",
        date: "2020/05/10",
        id: "00001",
    },
];

export default () => (
    <ArticleWrapper>
        {mockData.map((data) => {
            return (
                <>
                    <Link href={"/post/" + data.id} passHref>
                        <Article>
                            <Title>{data.title}</Title>
                            <Description>{data.description}</Description>
                            <Date>{data.date}</Date>
                        </Article>
                    </Link>
                </>
            );
        })}
    </ArticleWrapper>
);